###################################################################

# Created by write_sdc on Fri Mar 31 14:51:56 2023

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_operating_conditions typical -library typical
set_wire_load_mode segmented
set_wire_load_model -name ibm13_wl10 -library typical
set_max_fanout 16 [current_design]
set_driving_cell -lib_cell INVX2TR [get_ports clk_i]
set_driving_cell -lib_cell INVX2TR [get_ports rst_i]
set_driving_cell -lib_cell INVX2TR [get_ports {pe_id_i[1]}]
set_driving_cell -lib_cell INVX2TR [get_ports {pe_id_i[0]}]
set_driving_cell -lib_cell INVX2TR [get_ports {num_of_vertices_float16_i[15]}]
set_driving_cell -lib_cell INVX2TR [get_ports {num_of_vertices_float16_i[14]}]
set_driving_cell -lib_cell INVX2TR [get_ports {num_of_vertices_float16_i[13]}]
set_driving_cell -lib_cell INVX2TR [get_ports {num_of_vertices_float16_i[12]}]
set_driving_cell -lib_cell INVX2TR [get_ports {num_of_vertices_float16_i[11]}]
set_driving_cell -lib_cell INVX2TR [get_ports {num_of_vertices_float16_i[10]}]
set_driving_cell -lib_cell INVX2TR [get_ports {num_of_vertices_float16_i[9]}]
set_driving_cell -lib_cell INVX2TR [get_ports {num_of_vertices_float16_i[8]}]
set_driving_cell -lib_cell INVX2TR [get_ports {num_of_vertices_float16_i[7]}]
set_driving_cell -lib_cell INVX2TR [get_ports {num_of_vertices_float16_i[6]}]
set_driving_cell -lib_cell INVX2TR [get_ports {num_of_vertices_float16_i[5]}]
set_driving_cell -lib_cell INVX2TR [get_ports {num_of_vertices_float16_i[4]}]
set_driving_cell -lib_cell INVX2TR [get_ports {num_of_vertices_float16_i[3]}]
set_driving_cell -lib_cell INVX2TR [get_ports {num_of_vertices_float16_i[2]}]
set_driving_cell -lib_cell INVX2TR [get_ports {num_of_vertices_float16_i[1]}]
set_driving_cell -lib_cell INVX2TR [get_ports {num_of_vertices_float16_i[0]}]
set_driving_cell -lib_cell INVX2TR [get_ports {num_of_vertices_int8_i[7]}]
set_driving_cell -lib_cell INVX2TR [get_ports {num_of_vertices_int8_i[6]}]
set_driving_cell -lib_cell INVX2TR [get_ports {num_of_vertices_int8_i[5]}]
set_driving_cell -lib_cell INVX2TR [get_ports {num_of_vertices_int8_i[4]}]
set_driving_cell -lib_cell INVX2TR [get_ports {num_of_vertices_int8_i[3]}]
set_driving_cell -lib_cell INVX2TR [get_ports {num_of_vertices_int8_i[2]}]
set_driving_cell -lib_cell INVX2TR [get_ports {num_of_vertices_int8_i[1]}]
set_driving_cell -lib_cell INVX2TR [get_ports {num_of_vertices_int8_i[0]}]
set_driving_cell -lib_cell INVX2TR [get_ports {PEDelta_i[15]}]
set_driving_cell -lib_cell INVX2TR [get_ports {PEDelta_i[14]}]
set_driving_cell -lib_cell INVX2TR [get_ports {PEDelta_i[13]}]
set_driving_cell -lib_cell INVX2TR [get_ports {PEDelta_i[12]}]
set_driving_cell -lib_cell INVX2TR [get_ports {PEDelta_i[11]}]
set_driving_cell -lib_cell INVX2TR [get_ports {PEDelta_i[10]}]
set_driving_cell -lib_cell INVX2TR [get_ports {PEDelta_i[9]}]
set_driving_cell -lib_cell INVX2TR [get_ports {PEDelta_i[8]}]
set_driving_cell -lib_cell INVX2TR [get_ports {PEDelta_i[7]}]
set_driving_cell -lib_cell INVX2TR [get_ports {PEDelta_i[6]}]
set_driving_cell -lib_cell INVX2TR [get_ports {PEDelta_i[5]}]
set_driving_cell -lib_cell INVX2TR [get_ports {PEDelta_i[4]}]
set_driving_cell -lib_cell INVX2TR [get_ports {PEDelta_i[3]}]
set_driving_cell -lib_cell INVX2TR [get_ports {PEDelta_i[2]}]
set_driving_cell -lib_cell INVX2TR [get_ports {PEDelta_i[1]}]
set_driving_cell -lib_cell INVX2TR [get_ports {PEDelta_i[0]}]
set_driving_cell -lib_cell INVX2TR [get_ports {PEIdx_i[7]}]
set_driving_cell -lib_cell INVX2TR [get_ports {PEIdx_i[6]}]
set_driving_cell -lib_cell INVX2TR [get_ports {PEIdx_i[5]}]
set_driving_cell -lib_cell INVX2TR [get_ports {PEIdx_i[4]}]
set_driving_cell -lib_cell INVX2TR [get_ports {PEIdx_i[3]}]
set_driving_cell -lib_cell INVX2TR [get_ports {PEIdx_i[2]}]
set_driving_cell -lib_cell INVX2TR [get_ports {PEIdx_i[1]}]
set_driving_cell -lib_cell INVX2TR [get_ports {PEIdx_i[0]}]
set_driving_cell -lib_cell INVX2TR [get_ports PEValid_i]
set_driving_cell -lib_cell INVX2TR [get_ports {ProReady_i[1]}]
set_driving_cell -lib_cell INVX2TR [get_ports {ProReady_i[0]}]
set_driving_cell -lib_cell INVX2TR [get_ports vertexmem_ack_i]
set_driving_cell -lib_cell INVX2TR [get_ports edgemem_ack_i]
set_driving_cell -lib_cell INVX2TR [get_ports {vertexmem_resp_i[3]}]
set_driving_cell -lib_cell INVX2TR [get_ports {vertexmem_resp_i[2]}]
set_driving_cell -lib_cell INVX2TR [get_ports {vertexmem_resp_i[1]}]
set_driving_cell -lib_cell INVX2TR [get_ports {vertexmem_resp_i[0]}]
set_driving_cell -lib_cell INVX2TR [get_ports {vertexmem_tag_i[3]}]
set_driving_cell -lib_cell INVX2TR [get_ports {vertexmem_tag_i[2]}]
set_driving_cell -lib_cell INVX2TR [get_ports {vertexmem_tag_i[1]}]
set_driving_cell -lib_cell INVX2TR [get_ports {vertexmem_tag_i[0]}]
set_driving_cell -lib_cell INVX2TR [get_ports {vertexmem_data_i[63]}]
set_driving_cell -lib_cell INVX2TR [get_ports {vertexmem_data_i[62]}]
set_driving_cell -lib_cell INVX2TR [get_ports {vertexmem_data_i[61]}]
set_driving_cell -lib_cell INVX2TR [get_ports {vertexmem_data_i[60]}]
set_driving_cell -lib_cell INVX2TR [get_ports {vertexmem_data_i[59]}]
set_driving_cell -lib_cell INVX2TR [get_ports {vertexmem_data_i[58]}]
set_driving_cell -lib_cell INVX2TR [get_ports {vertexmem_data_i[57]}]
set_driving_cell -lib_cell INVX2TR [get_ports {vertexmem_data_i[56]}]
set_driving_cell -lib_cell INVX2TR [get_ports {vertexmem_data_i[55]}]
set_driving_cell -lib_cell INVX2TR [get_ports {vertexmem_data_i[54]}]
set_driving_cell -lib_cell INVX2TR [get_ports {vertexmem_data_i[53]}]
set_driving_cell -lib_cell INVX2TR [get_ports {vertexmem_data_i[52]}]
set_driving_cell -lib_cell INVX2TR [get_ports {vertexmem_data_i[51]}]
set_driving_cell -lib_cell INVX2TR [get_ports {vertexmem_data_i[50]}]
set_driving_cell -lib_cell INVX2TR [get_ports {vertexmem_data_i[49]}]
set_driving_cell -lib_cell INVX2TR [get_ports {vertexmem_data_i[48]}]
set_driving_cell -lib_cell INVX2TR [get_ports {vertexmem_data_i[47]}]
set_driving_cell -lib_cell INVX2TR [get_ports {vertexmem_data_i[46]}]
set_driving_cell -lib_cell INVX2TR [get_ports {vertexmem_data_i[45]}]
set_driving_cell -lib_cell INVX2TR [get_ports {vertexmem_data_i[44]}]
set_driving_cell -lib_cell INVX2TR [get_ports {vertexmem_data_i[43]}]
set_driving_cell -lib_cell INVX2TR [get_ports {vertexmem_data_i[42]}]
set_driving_cell -lib_cell INVX2TR [get_ports {vertexmem_data_i[41]}]
set_driving_cell -lib_cell INVX2TR [get_ports {vertexmem_data_i[40]}]
set_driving_cell -lib_cell INVX2TR [get_ports {vertexmem_data_i[39]}]
set_driving_cell -lib_cell INVX2TR [get_ports {vertexmem_data_i[38]}]
set_driving_cell -lib_cell INVX2TR [get_ports {vertexmem_data_i[37]}]
set_driving_cell -lib_cell INVX2TR [get_ports {vertexmem_data_i[36]}]
set_driving_cell -lib_cell INVX2TR [get_ports {vertexmem_data_i[35]}]
set_driving_cell -lib_cell INVX2TR [get_ports {vertexmem_data_i[34]}]
set_driving_cell -lib_cell INVX2TR [get_ports {vertexmem_data_i[33]}]
set_driving_cell -lib_cell INVX2TR [get_ports {vertexmem_data_i[32]}]
set_driving_cell -lib_cell INVX2TR [get_ports {vertexmem_data_i[31]}]
set_driving_cell -lib_cell INVX2TR [get_ports {vertexmem_data_i[30]}]
set_driving_cell -lib_cell INVX2TR [get_ports {vertexmem_data_i[29]}]
set_driving_cell -lib_cell INVX2TR [get_ports {vertexmem_data_i[28]}]
set_driving_cell -lib_cell INVX2TR [get_ports {vertexmem_data_i[27]}]
set_driving_cell -lib_cell INVX2TR [get_ports {vertexmem_data_i[26]}]
set_driving_cell -lib_cell INVX2TR [get_ports {vertexmem_data_i[25]}]
set_driving_cell -lib_cell INVX2TR [get_ports {vertexmem_data_i[24]}]
set_driving_cell -lib_cell INVX2TR [get_ports {vertexmem_data_i[23]}]
set_driving_cell -lib_cell INVX2TR [get_ports {vertexmem_data_i[22]}]
set_driving_cell -lib_cell INVX2TR [get_ports {vertexmem_data_i[21]}]
set_driving_cell -lib_cell INVX2TR [get_ports {vertexmem_data_i[20]}]
set_driving_cell -lib_cell INVX2TR [get_ports {vertexmem_data_i[19]}]
set_driving_cell -lib_cell INVX2TR [get_ports {vertexmem_data_i[18]}]
set_driving_cell -lib_cell INVX2TR [get_ports {vertexmem_data_i[17]}]
set_driving_cell -lib_cell INVX2TR [get_ports {vertexmem_data_i[16]}]
set_driving_cell -lib_cell INVX2TR [get_ports {vertexmem_data_i[15]}]
set_driving_cell -lib_cell INVX2TR [get_ports {vertexmem_data_i[14]}]
set_driving_cell -lib_cell INVX2TR [get_ports {vertexmem_data_i[13]}]
set_driving_cell -lib_cell INVX2TR [get_ports {vertexmem_data_i[12]}]
set_driving_cell -lib_cell INVX2TR [get_ports {vertexmem_data_i[11]}]
set_driving_cell -lib_cell INVX2TR [get_ports {vertexmem_data_i[10]}]
set_driving_cell -lib_cell INVX2TR [get_ports {vertexmem_data_i[9]}]
set_driving_cell -lib_cell INVX2TR [get_ports {vertexmem_data_i[8]}]
set_driving_cell -lib_cell INVX2TR [get_ports {vertexmem_data_i[7]}]
set_driving_cell -lib_cell INVX2TR [get_ports {vertexmem_data_i[6]}]
set_driving_cell -lib_cell INVX2TR [get_ports {vertexmem_data_i[5]}]
set_driving_cell -lib_cell INVX2TR [get_ports {vertexmem_data_i[4]}]
set_driving_cell -lib_cell INVX2TR [get_ports {vertexmem_data_i[3]}]
set_driving_cell -lib_cell INVX2TR [get_ports {vertexmem_data_i[2]}]
set_driving_cell -lib_cell INVX2TR [get_ports {vertexmem_data_i[1]}]
set_driving_cell -lib_cell INVX2TR [get_ports {vertexmem_data_i[0]}]
set_driving_cell -lib_cell INVX2TR [get_ports {edgemem_resp_i[3]}]
set_driving_cell -lib_cell INVX2TR [get_ports {edgemem_resp_i[2]}]
set_driving_cell -lib_cell INVX2TR [get_ports {edgemem_resp_i[1]}]
set_driving_cell -lib_cell INVX2TR [get_ports {edgemem_resp_i[0]}]
set_driving_cell -lib_cell INVX2TR [get_ports {edgemem_tag_i[3]}]
set_driving_cell -lib_cell INVX2TR [get_ports {edgemem_tag_i[2]}]
set_driving_cell -lib_cell INVX2TR [get_ports {edgemem_tag_i[1]}]
set_driving_cell -lib_cell INVX2TR [get_ports {edgemem_tag_i[0]}]
set_driving_cell -lib_cell INVX2TR [get_ports {edgemem_data_i[63]}]
set_driving_cell -lib_cell INVX2TR [get_ports {edgemem_data_i[62]}]
set_driving_cell -lib_cell INVX2TR [get_ports {edgemem_data_i[61]}]
set_driving_cell -lib_cell INVX2TR [get_ports {edgemem_data_i[60]}]
set_driving_cell -lib_cell INVX2TR [get_ports {edgemem_data_i[59]}]
set_driving_cell -lib_cell INVX2TR [get_ports {edgemem_data_i[58]}]
set_driving_cell -lib_cell INVX2TR [get_ports {edgemem_data_i[57]}]
set_driving_cell -lib_cell INVX2TR [get_ports {edgemem_data_i[56]}]
set_driving_cell -lib_cell INVX2TR [get_ports {edgemem_data_i[55]}]
set_driving_cell -lib_cell INVX2TR [get_ports {edgemem_data_i[54]}]
set_driving_cell -lib_cell INVX2TR [get_ports {edgemem_data_i[53]}]
set_driving_cell -lib_cell INVX2TR [get_ports {edgemem_data_i[52]}]
set_driving_cell -lib_cell INVX2TR [get_ports {edgemem_data_i[51]}]
set_driving_cell -lib_cell INVX2TR [get_ports {edgemem_data_i[50]}]
set_driving_cell -lib_cell INVX2TR [get_ports {edgemem_data_i[49]}]
set_driving_cell -lib_cell INVX2TR [get_ports {edgemem_data_i[48]}]
set_driving_cell -lib_cell INVX2TR [get_ports {edgemem_data_i[47]}]
set_driving_cell -lib_cell INVX2TR [get_ports {edgemem_data_i[46]}]
set_driving_cell -lib_cell INVX2TR [get_ports {edgemem_data_i[45]}]
set_driving_cell -lib_cell INVX2TR [get_ports {edgemem_data_i[44]}]
set_driving_cell -lib_cell INVX2TR [get_ports {edgemem_data_i[43]}]
set_driving_cell -lib_cell INVX2TR [get_ports {edgemem_data_i[42]}]
set_driving_cell -lib_cell INVX2TR [get_ports {edgemem_data_i[41]}]
set_driving_cell -lib_cell INVX2TR [get_ports {edgemem_data_i[40]}]
set_driving_cell -lib_cell INVX2TR [get_ports {edgemem_data_i[39]}]
set_driving_cell -lib_cell INVX2TR [get_ports {edgemem_data_i[38]}]
set_driving_cell -lib_cell INVX2TR [get_ports {edgemem_data_i[37]}]
set_driving_cell -lib_cell INVX2TR [get_ports {edgemem_data_i[36]}]
set_driving_cell -lib_cell INVX2TR [get_ports {edgemem_data_i[35]}]
set_driving_cell -lib_cell INVX2TR [get_ports {edgemem_data_i[34]}]
set_driving_cell -lib_cell INVX2TR [get_ports {edgemem_data_i[33]}]
set_driving_cell -lib_cell INVX2TR [get_ports {edgemem_data_i[32]}]
set_driving_cell -lib_cell INVX2TR [get_ports {edgemem_data_i[31]}]
set_driving_cell -lib_cell INVX2TR [get_ports {edgemem_data_i[30]}]
set_driving_cell -lib_cell INVX2TR [get_ports {edgemem_data_i[29]}]
set_driving_cell -lib_cell INVX2TR [get_ports {edgemem_data_i[28]}]
set_driving_cell -lib_cell INVX2TR [get_ports {edgemem_data_i[27]}]
set_driving_cell -lib_cell INVX2TR [get_ports {edgemem_data_i[26]}]
set_driving_cell -lib_cell INVX2TR [get_ports {edgemem_data_i[25]}]
set_driving_cell -lib_cell INVX2TR [get_ports {edgemem_data_i[24]}]
set_driving_cell -lib_cell INVX2TR [get_ports {edgemem_data_i[23]}]
set_driving_cell -lib_cell INVX2TR [get_ports {edgemem_data_i[22]}]
set_driving_cell -lib_cell INVX2TR [get_ports {edgemem_data_i[21]}]
set_driving_cell -lib_cell INVX2TR [get_ports {edgemem_data_i[20]}]
set_driving_cell -lib_cell INVX2TR [get_ports {edgemem_data_i[19]}]
set_driving_cell -lib_cell INVX2TR [get_ports {edgemem_data_i[18]}]
set_driving_cell -lib_cell INVX2TR [get_ports {edgemem_data_i[17]}]
set_driving_cell -lib_cell INVX2TR [get_ports {edgemem_data_i[16]}]
set_driving_cell -lib_cell INVX2TR [get_ports {edgemem_data_i[15]}]
set_driving_cell -lib_cell INVX2TR [get_ports {edgemem_data_i[14]}]
set_driving_cell -lib_cell INVX2TR [get_ports {edgemem_data_i[13]}]
set_driving_cell -lib_cell INVX2TR [get_ports {edgemem_data_i[12]}]
set_driving_cell -lib_cell INVX2TR [get_ports {edgemem_data_i[11]}]
set_driving_cell -lib_cell INVX2TR [get_ports {edgemem_data_i[10]}]
set_driving_cell -lib_cell INVX2TR [get_ports {edgemem_data_i[9]}]
set_driving_cell -lib_cell INVX2TR [get_ports {edgemem_data_i[8]}]
set_driving_cell -lib_cell INVX2TR [get_ports {edgemem_data_i[7]}]
set_driving_cell -lib_cell INVX2TR [get_ports {edgemem_data_i[6]}]
set_driving_cell -lib_cell INVX2TR [get_ports {edgemem_data_i[5]}]
set_driving_cell -lib_cell INVX2TR [get_ports {edgemem_data_i[4]}]
set_driving_cell -lib_cell INVX2TR [get_ports {edgemem_data_i[3]}]
set_driving_cell -lib_cell INVX2TR [get_ports {edgemem_data_i[2]}]
set_driving_cell -lib_cell INVX2TR [get_ports {edgemem_data_i[1]}]
set_driving_cell -lib_cell INVX2TR [get_ports {edgemem_data_i[0]}]
set_load -pin_load 0.01 [get_ports idle_o]
set_load -pin_load 0.01 [get_ports initialFinish_o]
set_load -pin_load 0.01 [get_ports PEReady_o]
set_load -pin_load 0.01 [get_ports {ProDelta0_o[15]}]
set_load -pin_load 0.01 [get_ports {ProDelta0_o[14]}]
set_load -pin_load 0.01 [get_ports {ProDelta0_o[13]}]
set_load -pin_load 0.01 [get_ports {ProDelta0_o[12]}]
set_load -pin_load 0.01 [get_ports {ProDelta0_o[11]}]
set_load -pin_load 0.01 [get_ports {ProDelta0_o[10]}]
set_load -pin_load 0.01 [get_ports {ProDelta0_o[9]}]
set_load -pin_load 0.01 [get_ports {ProDelta0_o[8]}]
set_load -pin_load 0.01 [get_ports {ProDelta0_o[7]}]
set_load -pin_load 0.01 [get_ports {ProDelta0_o[6]}]
set_load -pin_load 0.01 [get_ports {ProDelta0_o[5]}]
set_load -pin_load 0.01 [get_ports {ProDelta0_o[4]}]
set_load -pin_load 0.01 [get_ports {ProDelta0_o[3]}]
set_load -pin_load 0.01 [get_ports {ProDelta0_o[2]}]
set_load -pin_load 0.01 [get_ports {ProDelta0_o[1]}]
set_load -pin_load 0.01 [get_ports {ProDelta0_o[0]}]
set_load -pin_load 0.01 [get_ports {ProIdx0_o[7]}]
set_load -pin_load 0.01 [get_ports {ProIdx0_o[6]}]
set_load -pin_load 0.01 [get_ports {ProIdx0_o[5]}]
set_load -pin_load 0.01 [get_ports {ProIdx0_o[4]}]
set_load -pin_load 0.01 [get_ports {ProIdx0_o[3]}]
set_load -pin_load 0.01 [get_ports {ProIdx0_o[2]}]
set_load -pin_load 0.01 [get_ports {ProIdx0_o[1]}]
set_load -pin_load 0.01 [get_ports {ProIdx0_o[0]}]
set_load -pin_load 0.01 [get_ports ProValid0_o]
set_load -pin_load 0.01 [get_ports {ProDelta1_o[15]}]
set_load -pin_load 0.01 [get_ports {ProDelta1_o[14]}]
set_load -pin_load 0.01 [get_ports {ProDelta1_o[13]}]
set_load -pin_load 0.01 [get_ports {ProDelta1_o[12]}]
set_load -pin_load 0.01 [get_ports {ProDelta1_o[11]}]
set_load -pin_load 0.01 [get_ports {ProDelta1_o[10]}]
set_load -pin_load 0.01 [get_ports {ProDelta1_o[9]}]
set_load -pin_load 0.01 [get_ports {ProDelta1_o[8]}]
set_load -pin_load 0.01 [get_ports {ProDelta1_o[7]}]
set_load -pin_load 0.01 [get_ports {ProDelta1_o[6]}]
set_load -pin_load 0.01 [get_ports {ProDelta1_o[5]}]
set_load -pin_load 0.01 [get_ports {ProDelta1_o[4]}]
set_load -pin_load 0.01 [get_ports {ProDelta1_o[3]}]
set_load -pin_load 0.01 [get_ports {ProDelta1_o[2]}]
set_load -pin_load 0.01 [get_ports {ProDelta1_o[1]}]
set_load -pin_load 0.01 [get_ports {ProDelta1_o[0]}]
set_load -pin_load 0.01 [get_ports {ProIdx1_o[7]}]
set_load -pin_load 0.01 [get_ports {ProIdx1_o[6]}]
set_load -pin_load 0.01 [get_ports {ProIdx1_o[5]}]
set_load -pin_load 0.01 [get_ports {ProIdx1_o[4]}]
set_load -pin_load 0.01 [get_ports {ProIdx1_o[3]}]
set_load -pin_load 0.01 [get_ports {ProIdx1_o[2]}]
set_load -pin_load 0.01 [get_ports {ProIdx1_o[1]}]
set_load -pin_load 0.01 [get_ports {ProIdx1_o[0]}]
set_load -pin_load 0.01 [get_ports ProValid1_o]
set_load -pin_load 0.01 [get_ports {pe_vertex_reqAddr_o[15]}]
set_load -pin_load 0.01 [get_ports {pe_vertex_reqAddr_o[14]}]
set_load -pin_load 0.01 [get_ports {pe_vertex_reqAddr_o[13]}]
set_load -pin_load 0.01 [get_ports {pe_vertex_reqAddr_o[12]}]
set_load -pin_load 0.01 [get_ports {pe_vertex_reqAddr_o[11]}]
set_load -pin_load 0.01 [get_ports {pe_vertex_reqAddr_o[10]}]
set_load -pin_load 0.01 [get_ports {pe_vertex_reqAddr_o[9]}]
set_load -pin_load 0.01 [get_ports {pe_vertex_reqAddr_o[8]}]
set_load -pin_load 0.01 [get_ports {pe_vertex_reqAddr_o[7]}]
set_load -pin_load 0.01 [get_ports {pe_vertex_reqAddr_o[6]}]
set_load -pin_load 0.01 [get_ports {pe_vertex_reqAddr_o[5]}]
set_load -pin_load 0.01 [get_ports {pe_vertex_reqAddr_o[4]}]
set_load -pin_load 0.01 [get_ports {pe_vertex_reqAddr_o[3]}]
set_load -pin_load 0.01 [get_ports {pe_vertex_reqAddr_o[2]}]
set_load -pin_load 0.01 [get_ports {pe_vertex_reqAddr_o[1]}]
set_load -pin_load 0.01 [get_ports {pe_vertex_reqAddr_o[0]}]
set_load -pin_load 0.01 [get_ports pe_vertex_reqValid_o]
set_load -pin_load 0.01 [get_ports {pe_wrData_o[15]}]
set_load -pin_load 0.01 [get_ports {pe_wrData_o[14]}]
set_load -pin_load 0.01 [get_ports {pe_wrData_o[13]}]
set_load -pin_load 0.01 [get_ports {pe_wrData_o[12]}]
set_load -pin_load 0.01 [get_ports {pe_wrData_o[11]}]
set_load -pin_load 0.01 [get_ports {pe_wrData_o[10]}]
set_load -pin_load 0.01 [get_ports {pe_wrData_o[9]}]
set_load -pin_load 0.01 [get_ports {pe_wrData_o[8]}]
set_load -pin_load 0.01 [get_ports {pe_wrData_o[7]}]
set_load -pin_load 0.01 [get_ports {pe_wrData_o[6]}]
set_load -pin_load 0.01 [get_ports {pe_wrData_o[5]}]
set_load -pin_load 0.01 [get_ports {pe_wrData_o[4]}]
set_load -pin_load 0.01 [get_ports {pe_wrData_o[3]}]
set_load -pin_load 0.01 [get_ports {pe_wrData_o[2]}]
set_load -pin_load 0.01 [get_ports {pe_wrData_o[1]}]
set_load -pin_load 0.01 [get_ports {pe_wrData_o[0]}]
set_load -pin_load 0.01 [get_ports pe_wrEn_o]
set_load -pin_load 0.01 [get_ports {pe_edge_reqAddr_o[15]}]
set_load -pin_load 0.01 [get_ports {pe_edge_reqAddr_o[14]}]
set_load -pin_load 0.01 [get_ports {pe_edge_reqAddr_o[13]}]
set_load -pin_load 0.01 [get_ports {pe_edge_reqAddr_o[12]}]
set_load -pin_load 0.01 [get_ports {pe_edge_reqAddr_o[11]}]
set_load -pin_load 0.01 [get_ports {pe_edge_reqAddr_o[10]}]
set_load -pin_load 0.01 [get_ports {pe_edge_reqAddr_o[9]}]
set_load -pin_load 0.01 [get_ports {pe_edge_reqAddr_o[8]}]
set_load -pin_load 0.01 [get_ports {pe_edge_reqAddr_o[7]}]
set_load -pin_load 0.01 [get_ports {pe_edge_reqAddr_o[6]}]
set_load -pin_load 0.01 [get_ports {pe_edge_reqAddr_o[5]}]
set_load -pin_load 0.01 [get_ports {pe_edge_reqAddr_o[4]}]
set_load -pin_load 0.01 [get_ports {pe_edge_reqAddr_o[3]}]
set_load -pin_load 0.01 [get_ports {pe_edge_reqAddr_o[2]}]
set_load -pin_load 0.01 [get_ports {pe_edge_reqAddr_o[1]}]
set_load -pin_load 0.01 [get_ports {pe_edge_reqAddr_o[0]}]
set_load -pin_load 0.01 [get_ports pe_edge_reqValid_o]
create_clock [get_ports clk_i]  -period 10  -waveform {0 5}
set_clock_uncertainty 0.1  [get_clocks clk_i]
set_clock_transition -min -fall 0.1 [get_clocks clk_i]
set_clock_transition -min -rise 0.1 [get_clocks clk_i]
set_clock_transition -max -fall 0.1 [get_clocks clk_i]
set_clock_transition -max -rise 0.1 [get_clocks clk_i]
set_input_delay -clock clk_i  0.15  [get_ports rst_i]
set_input_delay -clock clk_i  0.15  [get_ports {pe_id_i[1]}]
set_input_delay -clock clk_i  0.15  [get_ports {pe_id_i[0]}]
set_input_delay -clock clk_i  0.15  [get_ports {num_of_vertices_float16_i[15]}]
set_input_delay -clock clk_i  0.15  [get_ports {num_of_vertices_float16_i[14]}]
set_input_delay -clock clk_i  0.15  [get_ports {num_of_vertices_float16_i[13]}]
set_input_delay -clock clk_i  0.15  [get_ports {num_of_vertices_float16_i[12]}]
set_input_delay -clock clk_i  0.15  [get_ports {num_of_vertices_float16_i[11]}]
set_input_delay -clock clk_i  0.15  [get_ports {num_of_vertices_float16_i[10]}]
set_input_delay -clock clk_i  0.15  [get_ports {num_of_vertices_float16_i[9]}]
set_input_delay -clock clk_i  0.15  [get_ports {num_of_vertices_float16_i[8]}]
set_input_delay -clock clk_i  0.15  [get_ports {num_of_vertices_float16_i[7]}]
set_input_delay -clock clk_i  0.15  [get_ports {num_of_vertices_float16_i[6]}]
set_input_delay -clock clk_i  0.15  [get_ports {num_of_vertices_float16_i[5]}]
set_input_delay -clock clk_i  0.15  [get_ports {num_of_vertices_float16_i[4]}]
set_input_delay -clock clk_i  0.15  [get_ports {num_of_vertices_float16_i[3]}]
set_input_delay -clock clk_i  0.15  [get_ports {num_of_vertices_float16_i[2]}]
set_input_delay -clock clk_i  0.15  [get_ports {num_of_vertices_float16_i[1]}]
set_input_delay -clock clk_i  0.15  [get_ports {num_of_vertices_float16_i[0]}]
set_input_delay -clock clk_i  0.15  [get_ports {num_of_vertices_int8_i[7]}]
set_input_delay -clock clk_i  0.15  [get_ports {num_of_vertices_int8_i[6]}]
set_input_delay -clock clk_i  0.15  [get_ports {num_of_vertices_int8_i[5]}]
set_input_delay -clock clk_i  0.15  [get_ports {num_of_vertices_int8_i[4]}]
set_input_delay -clock clk_i  0.15  [get_ports {num_of_vertices_int8_i[3]}]
set_input_delay -clock clk_i  0.15  [get_ports {num_of_vertices_int8_i[2]}]
set_input_delay -clock clk_i  0.15  [get_ports {num_of_vertices_int8_i[1]}]
set_input_delay -clock clk_i  0.15  [get_ports {num_of_vertices_int8_i[0]}]
set_input_delay -clock clk_i  0.15  [get_ports {PEDelta_i[15]}]
set_input_delay -clock clk_i  0.15  [get_ports {PEDelta_i[14]}]
set_input_delay -clock clk_i  0.15  [get_ports {PEDelta_i[13]}]
set_input_delay -clock clk_i  0.15  [get_ports {PEDelta_i[12]}]
set_input_delay -clock clk_i  0.15  [get_ports {PEDelta_i[11]}]
set_input_delay -clock clk_i  0.15  [get_ports {PEDelta_i[10]}]
set_input_delay -clock clk_i  0.15  [get_ports {PEDelta_i[9]}]
set_input_delay -clock clk_i  0.15  [get_ports {PEDelta_i[8]}]
set_input_delay -clock clk_i  0.15  [get_ports {PEDelta_i[7]}]
set_input_delay -clock clk_i  0.15  [get_ports {PEDelta_i[6]}]
set_input_delay -clock clk_i  0.15  [get_ports {PEDelta_i[5]}]
set_input_delay -clock clk_i  0.15  [get_ports {PEDelta_i[4]}]
set_input_delay -clock clk_i  0.15  [get_ports {PEDelta_i[3]}]
set_input_delay -clock clk_i  0.15  [get_ports {PEDelta_i[2]}]
set_input_delay -clock clk_i  0.15  [get_ports {PEDelta_i[1]}]
set_input_delay -clock clk_i  0.15  [get_ports {PEDelta_i[0]}]
set_input_delay -clock clk_i  0.15  [get_ports {PEIdx_i[7]}]
set_input_delay -clock clk_i  0.15  [get_ports {PEIdx_i[6]}]
set_input_delay -clock clk_i  0.15  [get_ports {PEIdx_i[5]}]
set_input_delay -clock clk_i  0.15  [get_ports {PEIdx_i[4]}]
set_input_delay -clock clk_i  0.15  [get_ports {PEIdx_i[3]}]
set_input_delay -clock clk_i  0.15  [get_ports {PEIdx_i[2]}]
set_input_delay -clock clk_i  0.15  [get_ports {PEIdx_i[1]}]
set_input_delay -clock clk_i  0.15  [get_ports {PEIdx_i[0]}]
set_input_delay -clock clk_i  0.15  [get_ports PEValid_i]
set_input_delay -clock clk_i  0.15  [get_ports {ProReady_i[1]}]
set_input_delay -clock clk_i  0.15  [get_ports {ProReady_i[0]}]
set_input_delay -clock clk_i  0.15  [get_ports vertexmem_ack_i]
set_input_delay -clock clk_i  0.15  [get_ports edgemem_ack_i]
set_input_delay -clock clk_i  0.15  [get_ports {vertexmem_resp_i[3]}]
set_input_delay -clock clk_i  0.15  [get_ports {vertexmem_resp_i[2]}]
set_input_delay -clock clk_i  0.15  [get_ports {vertexmem_resp_i[1]}]
set_input_delay -clock clk_i  0.15  [get_ports {vertexmem_resp_i[0]}]
set_input_delay -clock clk_i  0.15  [get_ports {vertexmem_tag_i[3]}]
set_input_delay -clock clk_i  0.15  [get_ports {vertexmem_tag_i[2]}]
set_input_delay -clock clk_i  0.15  [get_ports {vertexmem_tag_i[1]}]
set_input_delay -clock clk_i  0.15  [get_ports {vertexmem_tag_i[0]}]
set_input_delay -clock clk_i  0.15  [get_ports {vertexmem_data_i[63]}]
set_input_delay -clock clk_i  0.15  [get_ports {vertexmem_data_i[62]}]
set_input_delay -clock clk_i  0.15  [get_ports {vertexmem_data_i[61]}]
set_input_delay -clock clk_i  0.15  [get_ports {vertexmem_data_i[60]}]
set_input_delay -clock clk_i  0.15  [get_ports {vertexmem_data_i[59]}]
set_input_delay -clock clk_i  0.15  [get_ports {vertexmem_data_i[58]}]
set_input_delay -clock clk_i  0.15  [get_ports {vertexmem_data_i[57]}]
set_input_delay -clock clk_i  0.15  [get_ports {vertexmem_data_i[56]}]
set_input_delay -clock clk_i  0.15  [get_ports {vertexmem_data_i[55]}]
set_input_delay -clock clk_i  0.15  [get_ports {vertexmem_data_i[54]}]
set_input_delay -clock clk_i  0.15  [get_ports {vertexmem_data_i[53]}]
set_input_delay -clock clk_i  0.15  [get_ports {vertexmem_data_i[52]}]
set_input_delay -clock clk_i  0.15  [get_ports {vertexmem_data_i[51]}]
set_input_delay -clock clk_i  0.15  [get_ports {vertexmem_data_i[50]}]
set_input_delay -clock clk_i  0.15  [get_ports {vertexmem_data_i[49]}]
set_input_delay -clock clk_i  0.15  [get_ports {vertexmem_data_i[48]}]
set_input_delay -clock clk_i  0.15  [get_ports {vertexmem_data_i[47]}]
set_input_delay -clock clk_i  0.15  [get_ports {vertexmem_data_i[46]}]
set_input_delay -clock clk_i  0.15  [get_ports {vertexmem_data_i[45]}]
set_input_delay -clock clk_i  0.15  [get_ports {vertexmem_data_i[44]}]
set_input_delay -clock clk_i  0.15  [get_ports {vertexmem_data_i[43]}]
set_input_delay -clock clk_i  0.15  [get_ports {vertexmem_data_i[42]}]
set_input_delay -clock clk_i  0.15  [get_ports {vertexmem_data_i[41]}]
set_input_delay -clock clk_i  0.15  [get_ports {vertexmem_data_i[40]}]
set_input_delay -clock clk_i  0.15  [get_ports {vertexmem_data_i[39]}]
set_input_delay -clock clk_i  0.15  [get_ports {vertexmem_data_i[38]}]
set_input_delay -clock clk_i  0.15  [get_ports {vertexmem_data_i[37]}]
set_input_delay -clock clk_i  0.15  [get_ports {vertexmem_data_i[36]}]
set_input_delay -clock clk_i  0.15  [get_ports {vertexmem_data_i[35]}]
set_input_delay -clock clk_i  0.15  [get_ports {vertexmem_data_i[34]}]
set_input_delay -clock clk_i  0.15  [get_ports {vertexmem_data_i[33]}]
set_input_delay -clock clk_i  0.15  [get_ports {vertexmem_data_i[32]}]
set_input_delay -clock clk_i  0.15  [get_ports {vertexmem_data_i[31]}]
set_input_delay -clock clk_i  0.15  [get_ports {vertexmem_data_i[30]}]
set_input_delay -clock clk_i  0.15  [get_ports {vertexmem_data_i[29]}]
set_input_delay -clock clk_i  0.15  [get_ports {vertexmem_data_i[28]}]
set_input_delay -clock clk_i  0.15  [get_ports {vertexmem_data_i[27]}]
set_input_delay -clock clk_i  0.15  [get_ports {vertexmem_data_i[26]}]
set_input_delay -clock clk_i  0.15  [get_ports {vertexmem_data_i[25]}]
set_input_delay -clock clk_i  0.15  [get_ports {vertexmem_data_i[24]}]
set_input_delay -clock clk_i  0.15  [get_ports {vertexmem_data_i[23]}]
set_input_delay -clock clk_i  0.15  [get_ports {vertexmem_data_i[22]}]
set_input_delay -clock clk_i  0.15  [get_ports {vertexmem_data_i[21]}]
set_input_delay -clock clk_i  0.15  [get_ports {vertexmem_data_i[20]}]
set_input_delay -clock clk_i  0.15  [get_ports {vertexmem_data_i[19]}]
set_input_delay -clock clk_i  0.15  [get_ports {vertexmem_data_i[18]}]
set_input_delay -clock clk_i  0.15  [get_ports {vertexmem_data_i[17]}]
set_input_delay -clock clk_i  0.15  [get_ports {vertexmem_data_i[16]}]
set_input_delay -clock clk_i  0.15  [get_ports {vertexmem_data_i[15]}]
set_input_delay -clock clk_i  0.15  [get_ports {vertexmem_data_i[14]}]
set_input_delay -clock clk_i  0.15  [get_ports {vertexmem_data_i[13]}]
set_input_delay -clock clk_i  0.15  [get_ports {vertexmem_data_i[12]}]
set_input_delay -clock clk_i  0.15  [get_ports {vertexmem_data_i[11]}]
set_input_delay -clock clk_i  0.15  [get_ports {vertexmem_data_i[10]}]
set_input_delay -clock clk_i  0.15  [get_ports {vertexmem_data_i[9]}]
set_input_delay -clock clk_i  0.15  [get_ports {vertexmem_data_i[8]}]
set_input_delay -clock clk_i  0.15  [get_ports {vertexmem_data_i[7]}]
set_input_delay -clock clk_i  0.15  [get_ports {vertexmem_data_i[6]}]
set_input_delay -clock clk_i  0.15  [get_ports {vertexmem_data_i[5]}]
set_input_delay -clock clk_i  0.15  [get_ports {vertexmem_data_i[4]}]
set_input_delay -clock clk_i  0.15  [get_ports {vertexmem_data_i[3]}]
set_input_delay -clock clk_i  0.15  [get_ports {vertexmem_data_i[2]}]
set_input_delay -clock clk_i  0.15  [get_ports {vertexmem_data_i[1]}]
set_input_delay -clock clk_i  0.15  [get_ports {vertexmem_data_i[0]}]
set_input_delay -clock clk_i  0.15  [get_ports {edgemem_resp_i[3]}]
set_input_delay -clock clk_i  0.15  [get_ports {edgemem_resp_i[2]}]
set_input_delay -clock clk_i  0.15  [get_ports {edgemem_resp_i[1]}]
set_input_delay -clock clk_i  0.15  [get_ports {edgemem_resp_i[0]}]
set_input_delay -clock clk_i  0.15  [get_ports {edgemem_tag_i[3]}]
set_input_delay -clock clk_i  0.15  [get_ports {edgemem_tag_i[2]}]
set_input_delay -clock clk_i  0.15  [get_ports {edgemem_tag_i[1]}]
set_input_delay -clock clk_i  0.15  [get_ports {edgemem_tag_i[0]}]
set_input_delay -clock clk_i  0.15  [get_ports {edgemem_data_i[63]}]
set_input_delay -clock clk_i  0.15  [get_ports {edgemem_data_i[62]}]
set_input_delay -clock clk_i  0.15  [get_ports {edgemem_data_i[61]}]
set_input_delay -clock clk_i  0.15  [get_ports {edgemem_data_i[60]}]
set_input_delay -clock clk_i  0.15  [get_ports {edgemem_data_i[59]}]
set_input_delay -clock clk_i  0.15  [get_ports {edgemem_data_i[58]}]
set_input_delay -clock clk_i  0.15  [get_ports {edgemem_data_i[57]}]
set_input_delay -clock clk_i  0.15  [get_ports {edgemem_data_i[56]}]
set_input_delay -clock clk_i  0.15  [get_ports {edgemem_data_i[55]}]
set_input_delay -clock clk_i  0.15  [get_ports {edgemem_data_i[54]}]
set_input_delay -clock clk_i  0.15  [get_ports {edgemem_data_i[53]}]
set_input_delay -clock clk_i  0.15  [get_ports {edgemem_data_i[52]}]
set_input_delay -clock clk_i  0.15  [get_ports {edgemem_data_i[51]}]
set_input_delay -clock clk_i  0.15  [get_ports {edgemem_data_i[50]}]
set_input_delay -clock clk_i  0.15  [get_ports {edgemem_data_i[49]}]
set_input_delay -clock clk_i  0.15  [get_ports {edgemem_data_i[48]}]
set_input_delay -clock clk_i  0.15  [get_ports {edgemem_data_i[47]}]
set_input_delay -clock clk_i  0.15  [get_ports {edgemem_data_i[46]}]
set_input_delay -clock clk_i  0.15  [get_ports {edgemem_data_i[45]}]
set_input_delay -clock clk_i  0.15  [get_ports {edgemem_data_i[44]}]
set_input_delay -clock clk_i  0.15  [get_ports {edgemem_data_i[43]}]
set_input_delay -clock clk_i  0.15  [get_ports {edgemem_data_i[42]}]
set_input_delay -clock clk_i  0.15  [get_ports {edgemem_data_i[41]}]
set_input_delay -clock clk_i  0.15  [get_ports {edgemem_data_i[40]}]
set_input_delay -clock clk_i  0.15  [get_ports {edgemem_data_i[39]}]
set_input_delay -clock clk_i  0.15  [get_ports {edgemem_data_i[38]}]
set_input_delay -clock clk_i  0.15  [get_ports {edgemem_data_i[37]}]
set_input_delay -clock clk_i  0.15  [get_ports {edgemem_data_i[36]}]
set_input_delay -clock clk_i  0.15  [get_ports {edgemem_data_i[35]}]
set_input_delay -clock clk_i  0.15  [get_ports {edgemem_data_i[34]}]
set_input_delay -clock clk_i  0.15  [get_ports {edgemem_data_i[33]}]
set_input_delay -clock clk_i  0.15  [get_ports {edgemem_data_i[32]}]
set_input_delay -clock clk_i  0.15  [get_ports {edgemem_data_i[31]}]
set_input_delay -clock clk_i  0.15  [get_ports {edgemem_data_i[30]}]
set_input_delay -clock clk_i  0.15  [get_ports {edgemem_data_i[29]}]
set_input_delay -clock clk_i  0.15  [get_ports {edgemem_data_i[28]}]
set_input_delay -clock clk_i  0.15  [get_ports {edgemem_data_i[27]}]
set_input_delay -clock clk_i  0.15  [get_ports {edgemem_data_i[26]}]
set_input_delay -clock clk_i  0.15  [get_ports {edgemem_data_i[25]}]
set_input_delay -clock clk_i  0.15  [get_ports {edgemem_data_i[24]}]
set_input_delay -clock clk_i  0.15  [get_ports {edgemem_data_i[23]}]
set_input_delay -clock clk_i  0.15  [get_ports {edgemem_data_i[22]}]
set_input_delay -clock clk_i  0.15  [get_ports {edgemem_data_i[21]}]
set_input_delay -clock clk_i  0.15  [get_ports {edgemem_data_i[20]}]
set_input_delay -clock clk_i  0.15  [get_ports {edgemem_data_i[19]}]
set_input_delay -clock clk_i  0.15  [get_ports {edgemem_data_i[18]}]
set_input_delay -clock clk_i  0.15  [get_ports {edgemem_data_i[17]}]
set_input_delay -clock clk_i  0.15  [get_ports {edgemem_data_i[16]}]
set_input_delay -clock clk_i  0.15  [get_ports {edgemem_data_i[15]}]
set_input_delay -clock clk_i  0.15  [get_ports {edgemem_data_i[14]}]
set_input_delay -clock clk_i  0.15  [get_ports {edgemem_data_i[13]}]
set_input_delay -clock clk_i  0.15  [get_ports {edgemem_data_i[12]}]
set_input_delay -clock clk_i  0.15  [get_ports {edgemem_data_i[11]}]
set_input_delay -clock clk_i  0.15  [get_ports {edgemem_data_i[10]}]
set_input_delay -clock clk_i  0.15  [get_ports {edgemem_data_i[9]}]
set_input_delay -clock clk_i  0.15  [get_ports {edgemem_data_i[8]}]
set_input_delay -clock clk_i  0.15  [get_ports {edgemem_data_i[7]}]
set_input_delay -clock clk_i  0.15  [get_ports {edgemem_data_i[6]}]
set_input_delay -clock clk_i  0.15  [get_ports {edgemem_data_i[5]}]
set_input_delay -clock clk_i  0.15  [get_ports {edgemem_data_i[4]}]
set_input_delay -clock clk_i  0.15  [get_ports {edgemem_data_i[3]}]
set_input_delay -clock clk_i  0.15  [get_ports {edgemem_data_i[2]}]
set_input_delay -clock clk_i  0.15  [get_ports {edgemem_data_i[1]}]
set_input_delay -clock clk_i  0.15  [get_ports {edgemem_data_i[0]}]
set_output_delay -clock clk_i  0.15  [get_ports idle_o]
set_output_delay -clock clk_i  0.15  [get_ports initialFinish_o]
set_output_delay -clock clk_i  0.15  [get_ports PEReady_o]
set_output_delay -clock clk_i  0.15  [get_ports {ProDelta0_o[15]}]
set_output_delay -clock clk_i  0.15  [get_ports {ProDelta0_o[14]}]
set_output_delay -clock clk_i  0.15  [get_ports {ProDelta0_o[13]}]
set_output_delay -clock clk_i  0.15  [get_ports {ProDelta0_o[12]}]
set_output_delay -clock clk_i  0.15  [get_ports {ProDelta0_o[11]}]
set_output_delay -clock clk_i  0.15  [get_ports {ProDelta0_o[10]}]
set_output_delay -clock clk_i  0.15  [get_ports {ProDelta0_o[9]}]
set_output_delay -clock clk_i  0.15  [get_ports {ProDelta0_o[8]}]
set_output_delay -clock clk_i  0.15  [get_ports {ProDelta0_o[7]}]
set_output_delay -clock clk_i  0.15  [get_ports {ProDelta0_o[6]}]
set_output_delay -clock clk_i  0.15  [get_ports {ProDelta0_o[5]}]
set_output_delay -clock clk_i  0.15  [get_ports {ProDelta0_o[4]}]
set_output_delay -clock clk_i  0.15  [get_ports {ProDelta0_o[3]}]
set_output_delay -clock clk_i  0.15  [get_ports {ProDelta0_o[2]}]
set_output_delay -clock clk_i  0.15  [get_ports {ProDelta0_o[1]}]
set_output_delay -clock clk_i  0.15  [get_ports {ProDelta0_o[0]}]
set_output_delay -clock clk_i  0.15  [get_ports {ProIdx0_o[7]}]
set_output_delay -clock clk_i  0.15  [get_ports {ProIdx0_o[6]}]
set_output_delay -clock clk_i  0.15  [get_ports {ProIdx0_o[5]}]
set_output_delay -clock clk_i  0.15  [get_ports {ProIdx0_o[4]}]
set_output_delay -clock clk_i  0.15  [get_ports {ProIdx0_o[3]}]
set_output_delay -clock clk_i  0.15  [get_ports {ProIdx0_o[2]}]
set_output_delay -clock clk_i  0.15  [get_ports {ProIdx0_o[1]}]
set_output_delay -clock clk_i  0.15  [get_ports {ProIdx0_o[0]}]
set_output_delay -clock clk_i  0.15  [get_ports ProValid0_o]
set_output_delay -clock clk_i  0.15  [get_ports {ProDelta1_o[15]}]
set_output_delay -clock clk_i  0.15  [get_ports {ProDelta1_o[14]}]
set_output_delay -clock clk_i  0.15  [get_ports {ProDelta1_o[13]}]
set_output_delay -clock clk_i  0.15  [get_ports {ProDelta1_o[12]}]
set_output_delay -clock clk_i  0.15  [get_ports {ProDelta1_o[11]}]
set_output_delay -clock clk_i  0.15  [get_ports {ProDelta1_o[10]}]
set_output_delay -clock clk_i  0.15  [get_ports {ProDelta1_o[9]}]
set_output_delay -clock clk_i  0.15  [get_ports {ProDelta1_o[8]}]
set_output_delay -clock clk_i  0.15  [get_ports {ProDelta1_o[7]}]
set_output_delay -clock clk_i  0.15  [get_ports {ProDelta1_o[6]}]
set_output_delay -clock clk_i  0.15  [get_ports {ProDelta1_o[5]}]
set_output_delay -clock clk_i  0.15  [get_ports {ProDelta1_o[4]}]
set_output_delay -clock clk_i  0.15  [get_ports {ProDelta1_o[3]}]
set_output_delay -clock clk_i  0.15  [get_ports {ProDelta1_o[2]}]
set_output_delay -clock clk_i  0.15  [get_ports {ProDelta1_o[1]}]
set_output_delay -clock clk_i  0.15  [get_ports {ProDelta1_o[0]}]
set_output_delay -clock clk_i  0.15  [get_ports {ProIdx1_o[7]}]
set_output_delay -clock clk_i  0.15  [get_ports {ProIdx1_o[6]}]
set_output_delay -clock clk_i  0.15  [get_ports {ProIdx1_o[5]}]
set_output_delay -clock clk_i  0.15  [get_ports {ProIdx1_o[4]}]
set_output_delay -clock clk_i  0.15  [get_ports {ProIdx1_o[3]}]
set_output_delay -clock clk_i  0.15  [get_ports {ProIdx1_o[2]}]
set_output_delay -clock clk_i  0.15  [get_ports {ProIdx1_o[1]}]
set_output_delay -clock clk_i  0.15  [get_ports {ProIdx1_o[0]}]
set_output_delay -clock clk_i  0.15  [get_ports ProValid1_o]
set_output_delay -clock clk_i  0.15  [get_ports {pe_vertex_reqAddr_o[15]}]
set_output_delay -clock clk_i  0.15  [get_ports {pe_vertex_reqAddr_o[14]}]
set_output_delay -clock clk_i  0.15  [get_ports {pe_vertex_reqAddr_o[13]}]
set_output_delay -clock clk_i  0.15  [get_ports {pe_vertex_reqAddr_o[12]}]
set_output_delay -clock clk_i  0.15  [get_ports {pe_vertex_reqAddr_o[11]}]
set_output_delay -clock clk_i  0.15  [get_ports {pe_vertex_reqAddr_o[10]}]
set_output_delay -clock clk_i  0.15  [get_ports {pe_vertex_reqAddr_o[9]}]
set_output_delay -clock clk_i  0.15  [get_ports {pe_vertex_reqAddr_o[8]}]
set_output_delay -clock clk_i  0.15  [get_ports {pe_vertex_reqAddr_o[7]}]
set_output_delay -clock clk_i  0.15  [get_ports {pe_vertex_reqAddr_o[6]}]
set_output_delay -clock clk_i  0.15  [get_ports {pe_vertex_reqAddr_o[5]}]
set_output_delay -clock clk_i  0.15  [get_ports {pe_vertex_reqAddr_o[4]}]
set_output_delay -clock clk_i  0.15  [get_ports {pe_vertex_reqAddr_o[3]}]
set_output_delay -clock clk_i  0.15  [get_ports {pe_vertex_reqAddr_o[2]}]
set_output_delay -clock clk_i  0.15  [get_ports {pe_vertex_reqAddr_o[1]}]
set_output_delay -clock clk_i  0.15  [get_ports {pe_vertex_reqAddr_o[0]}]
set_output_delay -clock clk_i  0.15  [get_ports pe_vertex_reqValid_o]
set_output_delay -clock clk_i  0.15  [get_ports {pe_wrData_o[15]}]
set_output_delay -clock clk_i  0.15  [get_ports {pe_wrData_o[14]}]
set_output_delay -clock clk_i  0.15  [get_ports {pe_wrData_o[13]}]
set_output_delay -clock clk_i  0.15  [get_ports {pe_wrData_o[12]}]
set_output_delay -clock clk_i  0.15  [get_ports {pe_wrData_o[11]}]
set_output_delay -clock clk_i  0.15  [get_ports {pe_wrData_o[10]}]
set_output_delay -clock clk_i  0.15  [get_ports {pe_wrData_o[9]}]
set_output_delay -clock clk_i  0.15  [get_ports {pe_wrData_o[8]}]
set_output_delay -clock clk_i  0.15  [get_ports {pe_wrData_o[7]}]
set_output_delay -clock clk_i  0.15  [get_ports {pe_wrData_o[6]}]
set_output_delay -clock clk_i  0.15  [get_ports {pe_wrData_o[5]}]
set_output_delay -clock clk_i  0.15  [get_ports {pe_wrData_o[4]}]
set_output_delay -clock clk_i  0.15  [get_ports {pe_wrData_o[3]}]
set_output_delay -clock clk_i  0.15  [get_ports {pe_wrData_o[2]}]
set_output_delay -clock clk_i  0.15  [get_ports {pe_wrData_o[1]}]
set_output_delay -clock clk_i  0.15  [get_ports {pe_wrData_o[0]}]
set_output_delay -clock clk_i  0.15  [get_ports pe_wrEn_o]
set_output_delay -clock clk_i  0.15  [get_ports {pe_edge_reqAddr_o[15]}]
set_output_delay -clock clk_i  0.15  [get_ports {pe_edge_reqAddr_o[14]}]
set_output_delay -clock clk_i  0.15  [get_ports {pe_edge_reqAddr_o[13]}]
set_output_delay -clock clk_i  0.15  [get_ports {pe_edge_reqAddr_o[12]}]
set_output_delay -clock clk_i  0.15  [get_ports {pe_edge_reqAddr_o[11]}]
set_output_delay -clock clk_i  0.15  [get_ports {pe_edge_reqAddr_o[10]}]
set_output_delay -clock clk_i  0.15  [get_ports {pe_edge_reqAddr_o[9]}]
set_output_delay -clock clk_i  0.15  [get_ports {pe_edge_reqAddr_o[8]}]
set_output_delay -clock clk_i  0.15  [get_ports {pe_edge_reqAddr_o[7]}]
set_output_delay -clock clk_i  0.15  [get_ports {pe_edge_reqAddr_o[6]}]
set_output_delay -clock clk_i  0.15  [get_ports {pe_edge_reqAddr_o[5]}]
set_output_delay -clock clk_i  0.15  [get_ports {pe_edge_reqAddr_o[4]}]
set_output_delay -clock clk_i  0.15  [get_ports {pe_edge_reqAddr_o[3]}]
set_output_delay -clock clk_i  0.15  [get_ports {pe_edge_reqAddr_o[2]}]
set_output_delay -clock clk_i  0.15  [get_ports {pe_edge_reqAddr_o[1]}]
set_output_delay -clock clk_i  0.15  [get_ports {pe_edge_reqAddr_o[0]}]
set_output_delay -clock clk_i  0.15  [get_ports pe_edge_reqValid_o]
